#斐波那契数列（分治）
#0，1，1，2，3，5，8，13...f(n) = f(n-1) + f(n-2)
def fib(n: int) -> int:
    """斐波那契数列：递归"""
    # 终止条件 f(1) = 0, f(2) = 1
    if n == 1 or n == 2:
        return n - 1
    """为什么是n-1,因为n=1时f(1)=f(0)+f(-1)=0;
n=2时f(2)=f(1)+f(0)=1"""

    # 递归调用 f(n) = f(n-1) + f(n-2)
    #每个调用分支又会产生两个调用分支，形成一个二叉树，最终将产生层数为n的递归树，树的节点总数为2^n-1，因此时间复杂度为O(2^n)
    res = fib(n - 1) + fib(n - 2)
    # 返回结果 f(n)
    return res

"""Driver code"""
if __name__=="__main__":
    n=10
    res=fib(n)
    print(f"斐波那契数列第{n}项为: {res}")#34